#### Definition Members

---

|  |
| --- |
| Definition Class   Methods   Properties   See Also |

The  Definition  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter. |
| Public method | GetGroupTypeId | Returns the identifier of the parameter definition's parameter group. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Name | The user visible name for the parameter. |
| Public property | ParameterGroup | Returns the group ID of the parameter definition. |

# See Also

Definition Class

Autodesk.Revit.DB Namespace